# 选择结构
# if else else
'''
if 表达式1:
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）
    ……
elif 表达式2:
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）
……
else:
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）
    代码（前面必须是四个空格）

python中以缩进的方式区分代码块
代码4（不属于if结构）
'''

# age = int(input("请输入一个年龄\t"))
# if age<0 or age>200:
#     print("年龄不符合规范")
# elif age>18:
#     print("成年")
# elif age<18:
#     print("未成年")

# 循环结构
# for 循环，更多用于遍历数据容器
# while

# 计算1~100的和
i = 0
sum = 0
while i <= 100:
    sum += i
    i += 1
print(sum)
